#!/usr/bin/env python
# coding: utf-8

# In[1]:


import numpy as np
import pandas as bd
import matplotlib.pyplot as plt


# In[2]:


get_ipython().run_line_magic('matplotlib', 'inline')


# Загрузите модуль pyplot библиотеки matplotlib с псевдонимом plt, а также библиотеку numpy с псевдонимом np.
# Примените магическую функцию %matplotlib inline для отображения графиков в Jupyter Notebook и настройки конфигурации ноутбука со значением 'svg' для более четкого отображения графиков.
# Создайте список под названием x с числами 1, 2, 3, 4, 5, 6, 7 и список y с числами 3.5, 3.8, 4.2, 4.5, 5, 5.5, 7.
# С помощью функции plot постройте график, соединяющий линиями точки с горизонтальными координатами из списка x и вертикальными - из списка y.
# Затем в следующей ячейке постройте диаграмму рассеяния (другие названия - диаграмма разброса, scatter plot).
# 

# In[8]:


x = [1, 2, 3, 4, 5, 6, 7]
y = [3.5, 3.8, 4.2, 4.5, 5, 5.5, 7]


# In[10]:


plt.plot(x, y)
plt.show()


# In[11]:


plt.scatter(x, y)
plt.show()


# С помощью функции linspace из библиотеки Numpy создайте массив t из 51 числа от 0 до 10 включительно.

# In[14]:


np.linspace(0,10,51)


# Создайте массив Numpy под названием f, содержащий косинусы элементов массива t.
# Постройте линейную диаграмму, используя массив t для координат по горизонтали,а массив f - для координат по вертикали. Линия графика должна быть зеленого цвета.
# Выведите название диаграммы - 'График f(t)'. Также добавьте названия для горизонтальной оси - 'Значения t' и для вертикальной - 'Значения f'.
# Ограничьте график по оси x значениями 0.5 и 9.5, а по оси y - значениями -2.5 и 2.5.

# In[15]:


t = [2, 4, 5, 6, 7]
f = np.cos(t)
f


# In[23]:


plt.axis([0.5, 9.5, -2.5, 2.5])
plt.title('График f(t)')
plt.xlabel('Значения t')
plt.ylabel('Значения f')
plt.plot(t, f)
plt.show()


# In[ ]:




